//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//
//--------------------------------------------------------------------------------------------
//	WdmMerchantShip
//--------------------------------------------------------------------------------------------
//
//============================================================================================

#ifndef _WdmMerchantShip_H_
#define _WdmMerchantShip_H_

#include "WdmEnemyShip.h"

class WdmMerchantShip : public WdmEnemyShip
{
    //--------------------------------------------------------------------------------------------
    //Конструирование, деструктурирование
    //--------------------------------------------------------------------------------------------
  public:
    WdmMerchantShip();
    virtual ~WdmMerchantShip();

    void Goto(float x, float z, float rad);

  protected:
    //Найти силу притягивающую в нужном направлении
    void FindMoveForce() override;
    //Проверка на завершение
    bool KillTest() override;

    //Обновление сохраняемых данных
    void UpdateSaveData() override;
    //Установка параметров
    void SetSaveAttribute(ATTRIBUTES *save) override;

    //Установка параметров
    bool Load(const char *modelName) override;

    //--------------------------------------------------------------------------------------------
    //Инкапсуляция
    //--------------------------------------------------------------------------------------------
  private:
    CVECTOR gotoPos;
    float gotoRad;
    bool isEnableSetDir;
};

#endif
