//============================================================================================
//	Spirenkov Maxim, 2005
//--------------------------------------------------------------------------------------------
//
//--------------------------------------------------------------------------------------------
//	WdmWindUI
//--------------------------------------------------------------------------------------------
//
//============================================================================================

#ifndef _WdmWindUI_H_
#define _WdmWindUI_H_

#include "WdmInterfaceObject.h"

class WdmWindUI : public WdmInterfaceObject
{
    //--------------------------------------------------------------------------------------------
    //Конструирование, деструктурирование
    //--------------------------------------------------------------------------------------------
  public:
    WdmWindUI();
    virtual ~WdmWindUI();

    void SetAttributes(ATTRIBUTES *apnt);
    //Отрисовка
    void LRender(VDX9RENDER *rs) override;

    //--------------------------------------------------------------------------------------------
    //Инкапсуляция
    //--------------------------------------------------------------------------------------------
  private:
    long txBack;
    long txSky, txSkyMask;
    long txBar, txBarMask;
    long txWindPointer;
    long txMorale, txMoraleMask, txMoraleBar;
    long dateFont;
    float morale;
    long food;
    long rum;
    char month[12][128];
    long txCoord;
    long txNationFlag;
    float resizeRatio;
};

#endif
