//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//
//--------------------------------------------------------------------------------------------
//	WdmWarringShip
//--------------------------------------------------------------------------------------------
//
//============================================================================================

#ifndef _WdmWarringShip_H_
#define _WdmWarringShip_H_

#include "WdmEnemyShip.h"

class WdmWarringShip : public WdmEnemyShip
{
    struct MoveInfo
    {
        CVECTOR v;
        float dAng;
        float time;
        float kTime;
    };

    //--------------------------------------------------------------------------------------------
    //Конструирование, деструктурирование
    //--------------------------------------------------------------------------------------------
  public:
    WdmWarringShip();
    virtual ~WdmWarringShip();

    //Расчёты
    void Update(float dltTime) override;

    //Отрисовка
    void LRender(VDX9RENDER *rs) override;

  protected:
    //Все расчёты то перемещению вместе
    void Move(float dltTime) override{};

    //--------------------------------------------------------------------------------------------
    //Инкапсуляция
    //--------------------------------------------------------------------------------------------
  private:
    //Партиклы для дыма из пушек
    RS_RECT rect[24];
    MoveInfo move[24];
    long numRects;
    float brnTime;
    long texture;
};

#endif
