//============================================================================================
//	Spirenkov Maxim, 2001
//--------------------------------------------------------------------------------------------
//	Sea Dogs II
//--------------------------------------------------------------------------------------------
//	WdmIsland
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _WdmIsland_H_
#define _WdmIsland_H_

#include "WdmRenderModel.h"


class WdmIsland : public WdmRenderModel  
{
//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	WdmIsland();
	virtual ~WdmIsland();

	//Проверить на возможное столкновение
	bool CollisionTest(CMatrix & mtx, float length, float width, bool heighTest = true);
	//Проверить наличие в данном месте треугольников
	bool ObstacleTest(float x, float z, float radius);

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	

public:
	static CVECTOR centPos;
	static long numEdges;
	static CVECTOR curPos;
	static bool checkMode;

};

#endif

