//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	WdmMerchantShip
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _WdmMerchantShip_H_
#define _WdmMerchantShip_H_

#include "WdmEnemyShip.h"

class WdmMerchantShip : public WdmEnemyShip  
{
//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	WdmMerchantShip();
	virtual ~WdmMerchantShip();


	void Goto(float x, float z, float rad);


protected:
	//Найти силу притягивающую в нужном направлении
	virtual void FindMoveForce();
	//Проверка на завершение
	virtual bool KillTest();

	//Обновление сохраняемых данных
	virtual void UpdateSaveData();
	//Установка параметров
	virtual void SetSaveAttribute(ATTRIBUTES * save);

	//Установка параметров
	virtual bool Load(const char * modelName);


//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	CVECTOR gotoPos;
	float gotoRad;
	bool isEnableSetDir;
};

#endif

