//============================================================================================
//	Spirenkov Maxim, 2005
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	WdmWindUI
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _WdmWindUI_H_
#define _WdmWindUI_H_

#include "WdmInterfaceObject.h"

class WdmWindUI : public WdmInterfaceObject
{


//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	WdmWindUI();
	virtual ~WdmWindUI();

	void SetAttributes(ATTRIBUTES * apnt);
	//Отрисовка
	virtual void LRender(VDX8RENDER * rs);

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	long txBack;
	long txSky, txSkyMask;
	long txBar, txBarMask;
	long txWindPointer;
	long txMorale, txMoraleMask, txMoraleBar;
	long dateFont;
	float morale;
	long food;
	char month[12][128];
};

#endif

