//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	WdmWarringShip
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _WdmWarringShip_H_
#define _WdmWarringShip_H_

#include "WdmEnemyShip.h"

class WdmWarringShip : public WdmEnemyShip  
{
	struct MoveInfo
	{
		CVECTOR v;
		float dAng;
		float time;
		float kTime;		
	};

//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	WdmWarringShip();
	virtual ~WdmWarringShip();

	//Расчёты
	virtual void Update(float dltTime);

	//Отрисовка
	virtual void LRender(VDX8RENDER * rs);

protected:
	//Все расчёты то перемещению вместе
	virtual void Move(float dltTime){};

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	//Партиклы для дыма из пушек
	RS_RECT rect[24];
	MoveInfo move[24];
	long numRects;
	float brnTime;
	long texture;
};

#endif

