void InitRandomShipsNames()
{
	// Spain names
	int n = 0;
	n = AddStr2Array(&sRndShpSpName, n, "Анфитрита,Концепсион,Ель Синор,Сан Мигель,Лос Рейес,Лос Анчес,Кристофор,Христофор");
	n = AddStr2Array(&sRndShpSpName, n, "Аргонаута,Аррогант,Азия,Сан Педро эль Гранде,Сеньора,Дель Коро,Сантьяго,Атревида,Сантиссима,Тринидад");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Даниель,Багама,Сан Кристобаль,де ла Нина,дель Розарио,Конде де Регла");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Антонио,Сан Августин,Сан Фелиппе,Апостол,Сан Фернандо,Сан Хозе,Сан Джусто,Сан Леандро,Санта Агнес");
	n = AddStr2Array(&sRndShpSpName, n, "Синко Льягас,Эсмеральда,дель Хункаль,Аннунциация,Джезус Мариа,Фелиз,Феникс,Сан Николас");
	n = AddStr2Array(&sRndShpSpName, n, "Фуэрта,Гайлардо,Груне,Санта-Каталина Мартир,Глория,Ангел Гуардиа,Санта Тереза,Саэтия,Санта Круз");
	n = AddStr2Array(&sRndShpSpName, n, "Сан-Хуан,Батиста,Ель Сеньор,Сан Мигель,Бьен Сацезо,Инфанта Анна,Пуризма,Концептион");
	n = AddStr2Array(&sRndShpSpName, n, "Лимено,Сан Педро,де ла Фортуна,Агуилла Империал,Санта Мария,Евангелист,Милагроса,Перегрин");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Антонио,Сан Игнасио,Сан Франциско,Санта Анна,Санта Изабель,Джезус Мариа,Хосе,Де Ла Антигуа");
	n = AddStr2Array(&sRndShpSpName, n, "Сантьяго,Де Лос Трез Рейз,Баптиста,Сан Грегорио,Сальвадор дель Мундо,Соберано");
	n = AddStr2Array(&sRndShpSpName, n, "Галициа,Сан Антонио,Сан Августин,Сан Лукас,Сан Бруно,Санта Кристо,Маракайбо,Виржен,Пиляр");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Карлос,Сан Маркос,Сан Эстебан,Сан Фермин,Сан Фиорензо,Принципе,Астуриас,Сан Педро,Эль Гранде");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Фулгенцио,Сан Габриэль,Сан Генаро,Лос Ангелас,Санто-Доминго,де Полониа,Ла Муер,Святой Джоахим");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Хосе,Де Монтегудо,Сан Хасинто,Сан-Хуан Непомаседо,Сан Педро,Сан Томас,Агино");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Леандро,Ла Корона,Ла Преза,Сан Пабло Ла Преза,Сан Лоренцо,Сан Сальвадор,Сан Пабло,Санто Кристо,Бургос");
	n = AddStr2Array(&sRndShpSpName, n, "Алакантара,Мартир,Сан Рафаэль,Сан Ромон,Сан Себастьян,Сан Игнасио");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Винцент,Сан Исидро,Санта Акведа,Санта Анна,Санта Бригитта,Санта-Каталина,Сан Джеронимо");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Казилда,Санта Сесилия,Санта Клара,Ла Визитасьон,Нуэстра Сеньора,Ла Салутасьон,Вирген");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Флорентина,Сан Николас,Санта Изабелла,Санта Изолькадия,Санта Люсия,Санта Маргарита,Сан Фелиппе");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Мария,Санта Магдалена,Санта Матильда,Сан Висенте,Феррер,Альмадена");
	n = AddStr2Array(&sRndShpSpName, n, "Орфео,Санта Розолия,Санта Руфина,Санта Роза,Карлос II,Санта Тереза,Сан Кристо,Бургос,Сан Фелиппе");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Мартин,Пуэбла,Соберано,Ла Нативидад,Нуэстра,Бегона,Дон Кихот,Санче Пансо,Дульсинея,Ауроник,Эрнан Кортес,Колумбус");
    //22
    
	// England names
	n = 0;
	n = AddStr2Array(&sRndShpEnName, n, "Принсе Роял,Радуга,Констант Реформасьон,Сант Эндрю,Триумф,Вангард,Чарлиз,Генриетта Мариа,Парагон,Джеймс,Старый Джеймс,Единорог");
	n = AddStr2Array(&sRndShpEnName, n, "Решительный,Насеби,Роял Чарлз,Данбар,Генри,Лондон,Ричард,Роял Джеймс,Роял Принс,Королевский дуб,Роял Катерин,Лоял Лондон,Виктори,Чарльз,Сент Джордж");
	n = AddStr2Array(&sRndShpEnName, n, "Оссор,Принц Джордж,Дюк,Британия,Альбемарль,Бленхейм,Принцесс Энн,Дюшес,Замок Виндзор,Вангард,Роял Джеймс,Роял Вильям,Роял Энн,Принс");
	n = AddStr2Array(&sRndShpEnName, n, "Нептун,Фулл,Коронация,Стрела,Роял Суверен,Азия,Королева,Виктори,Объединение,Барфлер,Намур,Эвенжер,Триумф,Принс");
	n = AddStr2Array(&sRndShpEnName, n, "Вангард,Барфлеур,Базилик,Беагл,Бедфорд,Белиз,Королева Шарлотта,Уния,Бенбоу,Беркелей,Бервик,Черный Принц,Блэк Бланш,Блэнхейм");
	n = AddStr2Array(&sRndShpEnName, n, "Боннета,Гарлэнд,Храбрый,Вильям Мильс,Каледония,Катти Сарк,Бристоль,Британия,Дредноут,Катерина-Елизавета,Хоу,Трафальгар,Принс Регент,Роял Аделаида");
	n = AddStr2Array(&sRndShpEnName, n, "Кембридж,Камилла,Антилопа,Шаллоу,Леопард,Кэтрин,Грифон,Лион,Мэри,Спикер,Фортуна,Чемпион,Бонавенчур,Шарлотта,Харон,ФейрФакс,Мальборо");
	n = AddStr2Array(&sRndShpEnName, n, "Уорчестер,Данкерк,Эссекс,Тредаф,Резолюция,Лангпорт,Ньюбари,Месть,Лима,Монтегю,Глостер,Бриджвотер,Корнуэллис,Джеймс,Америкэн,Баунти,Лондон");
	n = AddStr2Array(&sRndShpEnName, n, "Креол,Крессен,Ленокс,Корона,Харвич,Решительный,Молодой лебедь,Эдгар,Монмауф,Силарк,Дефенс,Руперт,Варспайт,Монах,Дредноут,Энн");
	n = AddStr2Array(&sRndShpEnName, n, "Отчаянный,Реставрация,Надежда,Элизабет,Барфорд,Графтон,Замок Стирлинг,Иаков,Открытие,Дельфин,Пенденнис,Бреда,Поход принца Фредерика,Дредноут");
	n = AddStr2Array(&sRndShpEnName, n, "Экзетер,Дублин,Кент,Дункан,Эдгар,Эгмонт,Саллфолк,Слон,Изумруд,Чаровница,Эндимион,Грет Гарри,Энтрепренант,Золотой дракон,Торрингтон");
	n = AddStr2Array(&sRndShpEnName, n, "Девоншир,Рассел,Норфолк,Хамбер,Торбей,Ланкастер,Дортшир,Мария Селеста,Эндевор,Фея,Сокол,Винчестер,Фаворит,Олень,Ярмут,Сент Джордж,Манчестер");
	n = AddStr2Array(&sRndShpEnName, n, "Сила духа,Благосостояние,Барфорд,Ярость,Кент,Триумф,Возмездие,Орфорд,Соммерсет,Поход,Сюзан Констант,Арк Ройял,Замок Стерлинг,Глазго");
	n = AddStr2Array(&sRndShpEnName, n, "Уверенность,Тигр,Приключение,Провидение,Гарпия,Стремительный,Надменный,Ястреб,Опасность,Устрашающий,Разящий,Куллоден,Сент Микаэль");
	n = AddStr2Array(&sRndShpEnName, n, "Герой,Центурион,Портсмут,Джудит,Золотая Лань,Виктори,Прославленный,Непримиримый,Неприступный,Несгибаемый,Бесстрашный,Неукротимый,Антилопа");
	n = AddStr2Array(&sRndShpEnName, n, "Алмаз,Айрис,Непреодолимый,Изис,Джейсон,Руби,Кэтрин,Кент,Резолюшен,Леопард,Левиафан,Роял суверен,Хозяин Морей,Сент Эндрю");
	n = AddStr2Array(&sRndShpEnName, n, "Свобода,Молния,Лев,Мэри Роуз,Спэрроу,Лондон,Лира,Пеликан,Великолепный,Величественный,Сассекс,Дженни,Отважный,Авангард,Спорщик");
	n = AddStr2Array(&sRndShpEnName, n, "Бристоль,Пегас,Пеликан,Настойчивость,Феникс,Безжалостный,Кембридж,Оксфорд,Протектор,Защитник,Святой Георгий,Благоразумный,Болото Марстона");
	n = AddStr2Array(&sRndShpEnName, n, "Депфорд,Ловкий,Жемчуг,Принц Уильям,Победа,Бдительный,Мстительная,Гадюка,Лисица,Воспайт,Оса,Уильям и Мэри,Каледония,Александер,Кимберли");
	n = AddStr2Array(&sRndShpEnName, n, "Элефант,Сопротивление,Возмездие,Месть,Сихорс,Бэджер,Ловестов,Сэр Фрэнсис Дрэйк,Мощь,Роялист,Змея,Албемарл,Спидвелл,Быстрый,Спенсер,Сьюзен,Хорнблауэр");
	n = AddStr2Array(&sRndShpEnName, n, "Майский Цветок,Тигрица,Ласточка,Лебедь,Быстрый,Решительный,Задира,Ужасная,Темза,Победитель,Елизавета,Неустрашимый,Единорог,Улиссес,Ярмут,Дерзкий");
    //21
    
	// France names
	n = 0;
	n = AddStr2Array(&sRndShpFrName, n, "Ашатес,Ашиль,Ахиллес,Аннибаль,Жюстина,Латон,Луара,Марселец,Сен-Жан,Ла Тромпез,Ла Гарс,Болонтайр,Бургундия,Храбрец,Отвага,Буцентавре");
	n = AddStr2Array(&sRndShpFrName, n, "Артезиен,Астри,Огюст,Байоннайзе,Беллейзле,Торговля Бордо,Торговля Марселя,Конкорда,Доверие,Корона,Солей Ройаль,Протектёр,Ла Тактик,Ужасный");
	n = AddStr2Array(&sRndShpFrName, n, "Формидабле,Герцог Бургундии,Ла Помон,Ястреб,Фортуна,Фоудраянт,Астроляб,Ла Бель Пуль,Гваделупа,Воинственный,Неуязвимый,Империал");
	n = AddStr2Array(&sRndShpFrName, n, "Непобедимый,Бабочка,Патриот,Полетта,Пегас,Жемчужина,Превойянт,Протектёр,Защитник,Осторожная,Могущественный,Сен-Жермен,Резолия");
	n = AddStr2Array(&sRndShpFrName, n, "Сент Эспри,Мститель,Венец,Королева,Храбрец,Вендом,Победоносный,Святой Филипп,Дельфин Руаяль,Королевский дельфин,Монарх,Руаяль Дюк,Королева");
	n = AddStr2Array(&sRndShpFrName, n, "Сент Мишель,Сена,Месть,Лилия,Париж,Руаяль Тереза,Энрай,Правитель,Король Солнце,Скипетр,Великодушный,Смелый,Победоносный,Маренго,Устрашающий");
	n = AddStr2Array(&sRndShpFrName, n, "Восхитительный,Независимый,Великолепный,Победоносный,Отважный,Монарх,Надменный,Чудесный,Торговля Парижа,Редутабль,Сен-Луи,Ориенте");
	n = AddStr2Array(&sRndShpFrName, n, "Честолюбивый,Прекрасный,Победитель,Чудесный,Честолюбивый,Триумфальный,Геркулес,Верный,Шаранту,Риволи");
	n = AddStr2Array(&sRndShpFrName, n, "Бургундия,Гора,Океан,Восток,Народ,Монархия,Императорский,Монтебелло,Герой,Правитель,Прекрасный,Несгибаемый,Победоносный,Сирена");
	n = AddStr2Array(&sRndShpFrName, n, "Жеммап,Таж,Генрих IV,Дюгюэ-Труен,Тюренн,Вальми,Прекрасное Солнце,Герцог де Бургон,Знаменитый,Могучий,Неделимый,Бриз,Святой Луи");
	n = AddStr2Array(&sRndShpFrName, n, "Народ,Катон,Восток,Святой Разум,Лангедок,Антифедералист,Виктория,Венец,Огюст,Торжествующий,Неукротимый,Бесподобный,Прекрасный");
	n = AddStr2Array(&sRndShpFrName, n, "Алмаз,Рубин,Бурбон,Принц,Бесподобный,Фредерик,Победоносный,Великолепный,Отважный,Непобедимый,Нептун,Нормандия,Принцесса,Триумфатор");
	n = AddStr2Array(&sRndShpFrName, n, "Цветущий,Вермандуа,Эклатант,Парфет,Сюберб,Индиец,Гордец,Фогон,Святой Мишель,Гордый,Смелый,Верный,Полумесяц,Куртизант,Бодрый,Лавр");
	n = AddStr2Array(&sRndShpFrName, n, "Роскошный,Красивый,Генри,Рубин,Воинственный,Молниеносный,Гордый,Руаяль Луи,Бретань,Непобедимый");
	//14
	
	// Pirate names
	n = 0;
	n = AddStr2Array(&sRndShpPiName, n, "Плутон,Велиэнт,Гермес,Авенджер,Пеликан,Жемчуг,Мока,Пандора,Змея,Мери Спарк,Месть королевы Анны,Приключение,Дельфин,Счастливый Вильям,Золотая Лань,Сияние,Даркнесс,Натали");
	n = AddStr2Array(&sRndShpPiName, n, "Пегас,Ласточка,Мэйфлауэр,Генри,Король Жак,Черная смерть,Счастливчик Хью,Кровавый Билл,Сьюзен,Либерталия,Эспаньола,Бонавентура,Арабелла,Клото,Атропос,Лахезис,Вайтер,Дестини");
	n = AddStr2Array(&sRndShpPiName, n, "Роабак,Удача Джека,Счастливчик Джонни,Ангел ночи,Ужас Мэна,Морской еж,Воля судьбы,Призрак,Провидение,Чертово Око,Приговор,Счастливый дельфин,Зовущий бурю,Меняющий облик");
	n = AddStr2Array(&sRndShpPiName, n, "Черный принц,Демон,Демон ночи,Чудовище Хью,Кровавый пир,Ночной кошмар,Хищник,Золотая удача,Морской дьявол,Корона,Весельчак Хэм,Око бездны,Возмездие,Яростный,Безумный Грин");
	n = AddStr2Array(&sRndShpPiName, n, "Джентльмен удачи,Веселый мертвец,Кокетка Сью,Злая шутка,Черный пес,Колокол мести,Ураган,Белая акула,Смерч,Вездесущий,Колесо Фортуны,Молох,Невеста дьявола,Скромница,Стрелок");
	n = AddStr2Array(&sRndShpPiName, n, "Новый Свет,Плохая девчонка,Неожиданность,Черный барон,Мурена,Пиранья,Далила,Морской демон,Миф,Черный дракон,Си Кинг,Гудвин,Кобра,Безумный Морган,Оллегон,Глаас,Паук,Слепой Пью");
	n = AddStr2Array(&sRndShpPiName, n, "Пророк,Серый ангел,Грей,Пижон Дуд,Авадон,Шарк,Блэк даймонд,Васса,Грин Стоун,Фриз,Скаут,Диамант,Морская Лисица,Падший ангел,Звездная рыба,Волверин,Ворриор,Лекса");
	n = AddStr2Array(&sRndShpPiName, n, "Верная смерть,Шалунья,Шаровая молния,Любимец удачи,Бешенный Билл,Душегуб,Душелов,Дос Пирато,Бык,Кортес,Экспиус,Джерри,Флетчер Линд,Шепот,Милан,Бес,Вархам,Лепур");
	n = AddStr2Array(&sRndShpPiName, n, "Китти,Горила,Преподобный,Блэк Джек,Король Артур,Вдоводел,Страй,Эль Дьябло,Энкарнадо,Грифон,Эдуард I,Неодолимый,Женоненавистник,Возмездие,Смерть Америке");
    //9
    
	// Holland names
	n = 0;
	n = AddStr2Array(&sRndShpHoName, n, "Мориаанс Хоофд,Бирг Ван Леиджден,Бруинвиш,Гельдерланд,Фрисландия,Хазевинт,Долфин,Зеекалф,Принц Маурицио,Принц Виллен,Дерфлингер,Ротер Люв,Вриджит,Ваакзаакхейм,Гроене Драек,Король Виллен,Вилльям де Эерст");
	n = AddStr2Array(&sRndShpHoName, n, "Фолен,Южная Провинция,Адмираль де Рюижтэ,Адмираль Тжерк,Гекрунди Лью,Кампел,Деврайс,Дордрехт,Гелдерлэнд,Гелиджхейт,Геркулес,Херстеллер,Холланд,Нептунис,Эмилиа,Лейджент,Стад эн Ланде,Хонслаарсдиик");
	n = AddStr2Array(&sRndShpHoName, n, "Остерго,Ротер Люв,Эмилиа,Бредерое,Де Зевен Провинсиен,Амстердам,Оверджезел,Плутон,Принс Фредерик,Принс Мауритс,Гауда,Роттердам,Утрехт,Вестфалия,Зеландия,Меермен,Омландиа,Прайнсесс Луиза,Горихем,Стеенберген");
	n = AddStr2Array(&sRndShpHoName, n, "Прайнсесс Мария Луиза,Адмираал Пит Хеин,Алькмаар,Флиигенде Херт,Тониин,Фетис,Саламандра,Овериссель,Дельфт,Эрфпринц,Глейнтхаус,Идущий,Кронпринц Уильям,Алькмаар,Белфт,Бесчермеер,Браакел,Ландискрон,Корнелия");
	n = AddStr2Array(&sRndShpHoName, n, "Роттердам,Арвеприас,Нолланде Туин,Кронпринц Уильям,Дерфлингер,Ротер Люв,Эмилиа,Гауда Лииу,Фрисланд,Гроен Дрэк,Медемблик,Нептунус,Бель Антуанетта,Де Зевен Провинсиен,Западная Фрисландия,Шриккервеккер");
	n = AddStr2Array(&sRndShpHoName, n, "Хооп,Принс Хендрик,Сампсон,Сваертен Бул,Дерфлингер,Ротер Люв,Эмилиа,Де Зевен Провинсиен,Флиегенде Драек,Дерфлингер,Ротер Люв,Эмилиа,Маахт ван Дордрехт,Фредерик Хендрик,Алсион,Бреда,Девентер");
	n = AddStr2Array(&sRndShpHoName, n, "Эрфпринц Брусвик,Уопен ван Зиланд,Синт Лауренс,Омландиа,Мидделбург,Гроот Кристоффел,Боомел,Зиерикзее,Уоопен ван Нассау,Уопен ван Холланд,Уолшерен,Беллона,Тер Гоес,Дофин,Меерминне,Конинк Давид,Гидеон,Еендрахт");
	n = AddStr2Array(&sRndShpHoName, n, "Гекрунде Лиифде,Ахиллес,Дофин,Утрехт,Тхетис,Гульден Дофин,Маас,Уоакзаамхеид,Миддельбург,Нассау,Витте Еенхоорн,Уопен ван Хоорн,Зутпхен,Грот зутпхен,Овериссель,Утрехт,Вест капелле,Гельдерлант,катарина");
	n = AddStr2Array(&sRndShpHoName, n, "Роскам,Роттердам,Уопен ван Нолланд,Кастеел ван Медемблик,Уопен ван Медемблик,Монникендам,Уопенн ван Монникендам,Фергульде Зон,Гойес,Гронинген,Принцесс Роял Мариа,Меермин,Фогельструиис,Зеландиа,Фереенигде Провинсиен");
	n = AddStr2Array(&sRndShpHoName, n, "Эдам,Уопен ван Эдам,Хаарлем,Монникендам,Гульден Стар,Боммел,Бредероде,Бурхт ван Алкмаар,Енкхуизен,Уопен ван Енкхуизен,Лееварден,Ниимеген,Фазант,Элсвоуд,Лейден,Уопен ван Лейден,Норд Холланд,Домбург,Хаас,Адмирал Дженераал");
	//10
}
