//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	NoiseCloud
//--------------------------------------------------------------------------------------------
//	
//============================================================================================

#ifndef _NoiseCloud_H_
#define _NoiseCloud_H_

#include "..\common_h\dx8render.h"
#include "..\common_h\matrix.h"
#include "Pillar.h"

class NoiseCloud  
{
	struct Rect
	{
		float r, a;		//Позиция в радиальной системе координат
		float angle;	//Угл поворота
		float size;		//Размер
		float alpha;	//Общая прозрачность
		float light;	//Освещённость
		float kLight;	//В процессе подсветки значение освещённости
		float tLight;	//Время с последнего просвета
	};

	struct Vertex
	{
		CVECTOR pos;
		dword color;
		float u, v;
	};

//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	NoiseCloud(Pillar & _pillar);
	virtual ~NoiseCloud();

	void Update(float dltTime);
	void Draw(VDX8RENDER * rs);

	void SetGlobalAlpha(float a);

	long texture;

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	Pillar & pillar;
	float galpha;
	long lightCnt;
	Rect rect[64];
	Vertex buf[6*64];
};

#endif

