//============================================================================================
// Spirenkov Maxim, 2003
//============================================================================================
// Box
//============================================================================================

#ifndef _Box_h_
#define _Box_h_

#pragma pack(push, 1)

#include "Vector.h"

///Класс представления ориентированного по осям ящика
class Box
{
public:
	union
	{
		struct
		{
			///Позиция центра
			Vector p;
		};
		struct
		{
			///Позиция центра
			Vector pos;
		};
		struct
		{
			///Позиция центра
			Vector c;
		};
		struct
		{
			///Позиция центра
			Vector center;
		};
	};
	union
	{
		struct
		{
			///Размер
			Vector s;
		};
		struct
		{
			///Размер
			Vector size;
		};
	};


};




#pragma pack(pop)

#endif