//============================================================================================
//	Spirenkov Maxim aka Sp-Max Shaman, 2001
//--------------------------------------------------------------------------------------------
//	Storm engine v2.00
//--------------------------------------------------------------------------------------------
//	UserData
//--------------------------------------------------------------------------------------------
//	Хранение и доступ к пользовательским данным
//============================================================================================

#ifndef _UserData_H_
#define _UserData_H_


#include "..\Common_h\d_types.h"
#include "..\Common_h\memop.h"
#include "..\Common_h\exs.h"


class UserData  
{
	struct Data
	{
		long hashCode;		//Числовое значение имени
		long name;			//Индекс начала имени
		long data;			//Индекс начала строки данных
	};

//--------------------------------------------------------------------------------------------
//Конструирование, деструктурирование
//--------------------------------------------------------------------------------------------
public:
	UserData();
	virtual ~UserData();
	
//--------------------------------------------------------------------------------------------
//Работа с данными
//--------------------------------------------------------------------------------------------
public:
	//Добавить данные
	void AddData(const char * dname, const char * sdata);
	//Освободить лишнюю память после добавления данных
	void FreeExtra();
	//Найти пользовательские данные
	const char * GetData(const char * dataName);

//--------------------------------------------------------------------------------------------
//Инкапсуляция
//--------------------------------------------------------------------------------------------
private:
	static long CalcHashString(const char * str);

private:
	Data * data;					//Индексы данных
	long numData;					//Число данных
	long maxData;					//Размер массива
	
	char * strings;					//Массив строк
	long numBytes;					//Количество используемых байт
	long maxBytes;					//Размер массива
};

#endif

