//============================================================================================
//	Spirenkov Maxim, 2003
//--------------------------------------------------------------------------------------------
//
//--------------------------------------------------------------------------------------------
//	LocRats
//--------------------------------------------------------------------------------------------
//
//============================================================================================

#ifndef _LocRats_h_
#define _LocRats_h_

#include "collide.h"
#include "dx8render.h"
#include "matrix.h"
#include "vmodule_api.h"

#include "LocRat.h"

class LocRats : public ENTITY
{
  public:
    LocRats();
    virtual ~LocRats();

    //--------------------------------------------------------------------------------------------
  public:
    //Инициализация
    bool Init();
    //Исполнение
    void Execute(dword delta_time);
    //Рисование
    void Realize(dword delta_time);

    //Сообщения
    dword _cdecl ProcessMessage(MESSAGE &message);

    //--------------------------------------------------------------------------------------------
  private:
    LocRat rat[32];
    long num;
};

#endif
