string DLG_TEXT[57] = {
"Офицер не нужен, капитан?",
"Офицер? А на что ты годен?",
"Нет, у меня полный комплект.",
"Ну, говорят, что я неплохой ",
". Возьмите меня на свое судно, капитан - убедитесь в этом сами.",
"Сколько ты хочешь?",
"Увы, у меня уже есть ",
".",
"Неужели передумали, капитан? Решили, что новый ",
" вам не помешает?",
"Пожалуй, так. Сколько ты хочешь?",
"Ошибаешься. Счастливо оставаться.",
"Думаю, мы с вами сойдемся на ",
" пиастров.",
"Не слишком ли ты много хочешь?",
"Я согласен. Считай себя зачисленным в команду.",
"Ты не стоишь этих денег. Прощай.",
"Хорошо...Пожалуй, я готов согласиться даже на ",
" пиастров. Ну как?",
"Вот это уже лучше. Ты принят.",
"Я по-прежнему считаю, что это чересчур. Прощай.",
"Увы, капитан, я стою именно столько, сколько запросил. Если это слишком дорого для вас - поищите кого-нибудь другого.",
"Ну ладно, я согласен. Я беру тебя.",
"Так я и поступлю. Всего хорошего.",
"Благодарю вас, капитан. Вы не пожалеете, что отдали мне это золото.",
"Хочется в это верить.",
"Эй, похоже, у вас проблемы с наличностью! Извините, капитан, но я не работаю в кредит.",
"Ах ты, черт!",
"Сейчас я допью, капитан, и отправлюсь на борт. Не извольте беспокоиться - я успею до отплытия.",
"Хорошо. Опоздаешь - заставлю драить палубу!.",
"Что вы хотите, капитан?",
"Ничего. Вольно.",
"Ты уволен. Я обойдусь без твоих услуг!",
"Как скажете, капитан. Но смотрите: если вы выгоните меня - я больше никогда не вернусь на ваше судно. Так что решать вам.",
"Пожалуй, я передумал. Ты мне еще нужен.",
"Отлично. Можешь проваливать, куда подальше.",
"Я же предупреждал вас, капитан, что не вернусь на ваш корабль. У меня есть своя гордость.",
"Да ты мне и не нужен!", // boal 05.09.03 offecer need to go to abordage -->
"Мне нужно, что бы ты участвовал в абордаже.", // 38
"Побереги себя, не участвуй в абордаже. Это приказ!",
"Так точно, капитан! Есть участвовать в абордаже!",
"Вольно.", // 41
"Есть отсидеться в трюме!",
"Стой здесь!", // 43
"Следуй за мной и не отставай!",
"Есть изменить дислокацию!", //45
"Я хочу с тобой обсудить тактику боя во время абордажа.",//46
"Я вас слушаю.",//47
"Слушай мой приказ!",//48
"Какие будут приказания?",//49
"Я хочу поговорить о твоем повышении.",//50
"Я хочу, чтобы ты занял место губернатора этой колонии!",//51
"Благодарю за доверие.",//52
"Надеюсь ты оправдаешь мои надежды!",//53
"Ром - лучшее лекарство от скуки!",//54
"Не буду мешать.",//55
"",
};
