//============================================================================================
//	Spirenkov Maxim, 2002
//--------------------------------------------------------------------------------------------
//	
//--------------------------------------------------------------------------------------------
//	grs
//--------------------------------------------------------------------------------------------
//	Формат файла grs
//============================================================================================


#ifndef _GRS_H_
#define _GRS_H_

//============================================================================================

#pragma pack(push, 1)

//============================================================================================
//
//		GRSHeader
//		GRSMiniMapElement[miniZ][miniX]
//		GRSMapElement[numElements]
//
//============================================================================================


#define GRASS_ID	'ssrG'
#define GRASS_VER	'00.1'


#define GRASS_BLK_DST	1.0f							//Размер блока
#define GRASS_CNT_MIN	16								//Минимальное количество травинок в блоке
#define GRASS_CNT_DLT	8								//Разброс в количестве травинок
#define GRASS_STEP		(GRASS_BLK_DST/GRASS_BLK_SIZE)	//Шаг сетки травы
#define GRASS_BLK_POW	5								//Степень размера блока 2^N
#define GRASS_BLK_SIZE	(1 << GRASS_BLK_POW)			//Размер сетки блока M = 2^N
#define GRASS_BLK_MASK	(GRASS_BLK_SIZE - 1)			//Маска размера блока


struct GRSHeader
{
	unsigned long id;		//Идентификатор
	unsigned long ver;		//Версия
	long miniX, miniZ;		//Размеры миникарты
	float startX, startZ;	//Позиция карты
	long numElements;		//Количество элементов (травинок)
};

struct GRSMiniMapElement
{
	long start;			//Начало блока
	long num[4];		//Количество травы в блоке
	float minHeight;	//Минимальная высота в блока
	float maxHeight;	//Максимальная высота в блока
};

struct GRSMapElement
{
	unsigned char x, z;			//Позиция травинки в блоке
	unsigned char w : 4, h : 4;	//Ширина и высота
	unsigned char frame : 4;	//Кадр
	unsigned char ang : 4;		//Угл поворота
	float y;					//Высота в мировых координатах
};


//============================================================================================

#pragma pack(pop)

//============================================================================================

#endif
