//============================================================================================
//	Spirenkov Maxim, 2001
//--------------------------------------------------------------------------------------------
//	Patch
//--------------------------------------------------------------------------------------------
//	ptc
//--------------------------------------------------------------------------------------------
//	Файл данных, необходимых для поиска пути и коллизии персонажей с землёй
//============================================================================================

#ifndef _PTC_H_
#define _PTC_H_


#pragma pack(push, 1)

//============================================================================================
//
//  Структура файла ptc:
//
//
//  PtcHeader											Заголовок файла
//	PtcTriangle[PtcHeader.numTriangles]
//	PtcVertex[PtcHeader.numVerteces]
//	PtcNormal[PtcHeader.numNormals]
//	PtcMap[PtcHeader.mapL*PtcHeader.mapW]
//	unsigned short[numIndeces]
//	path lines
//	PtcMaterials
//
//============================================================================================


#define PTC_ID			' CTP'			//Идентификатор файла
#define PTC_VERSION		'10.1'			//Версия файла
#define PTC_PREVERSION1	'00.1'			//Предыдущая версия файла
#define PTC_SPACEFLD	'    '			//Пробелы для удобного чтения
#define PTC_WITHSEA		' AES'			//Патч для морской локации
#define PTC_NOSEA		' HTE'			//Патч для локации без моря

//Заголовок файла
struct PtcHeader
{
	long id;							//Идентификатор файла
	long space0;						//Неиспользуеться '    '
	long ver;							//Версия файла
	long space1;						//Неиспользуеться '    '
	long isSea;							//Пишет, патч для морской локации или нет
	long space2;						//Неиспользуеться '    '
	long numTriangles;					//Количество треугольников 
	long numVerteces;					//Количество индексированных вершин
	long numNormals;					//Количество нормалей
	long mapL, mapW;					//Размеры карты коллизии
	long numIndeces;					//Размер таблицы индексов
	long lineSize;						//Размер строки в таблице поиска пути
	float minX, minY, minZ;				//Минимальная граница ящика
	float maxX, maxY, maxZ;				//Максимальная граница ящика
};

struct PtcTriangle
{
	unsigned short i[3];				//Индексы вершин
	unsigned short n;					//Нормаль к треугольнику
	short nb[3];						//Индексы соседей
	char mtl;							//Индекс материала
	char flags;
};

struct PtcVertex
{
	float x;							//Позиция по X
	float y;							//Позиция по Y
	float z;							//Позиция по Z
};

struct PtcNormal
{
	float x;							//Направление по X
	float y;							//Направление по Y
	float z;							//Направление по Z
};

struct PtcMap
{
	long start;							//Начало таблицы полигонов, входящих в ячейку карты
	long size;							//Размер таблицы полигонов, входящих в ячейку карты
};

struct PtcMaterials
{
	long numMaterials;					//Количество материалов
	char material[16][16];				//Таблица материалов
};

//============================================================================================

#pragma pack(pop)

#endif


