//============================================================================================
// Spirenkov Maxim, 2003
//============================================================================================
// Box
//============================================================================================

#ifndef _Box_h_
#define _Box_h_

#pragma pack(push, 1)

#include "../CVector.h"

///Класс представления ориентированного по осям ящика
class Box
{
  public:
    union {
        struct
        {
            ///Позиция центра
            CVECTOR p;
        };
        struct
        {
            ///Позиция центра
            CVECTOR pos;
        };
        struct
        {
            ///Позиция центра
            CVECTOR c;
        };
        struct
        {
            ///Позиция центра
            CVECTOR center;
        };
    };
    union {
        struct
        {
            ///Размер
            CVECTOR s;
        };
        struct
        {
            ///Размер
            CVECTOR size;
        };
    };
};

#pragma pack(pop)

#endif